Revit 2027 API
CableType.Duplicate Method
Overload List
Name | Description
Duplicate() |  Duplicates this Cable Type.
Duplicate(String) |  Duplicates an existing element type and assigns it a new name.
Top
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace